Skill = function() {
};
SerializableMap.init(Skill);

Skill.template = {
	type:'object',
	itemTemplate:[
		{name:'id', type:'string'},
		{name:'effects', type:'list', itemTemplate:Effect.template},
		{name:'desc', type:'string'},
	],
};

Skill.cntEleType = 3;

Skill.prototype.onCreated = function() {
	for(var i=0;i<this.effects.length;++i) {
		this.effects[i] = new Effect(this.effects[i]);
	}
};

Skill.prototype.clone = function() {
	var item = new Skill();
	var templates = Skill.template.itemTemplate;
	for(var i=0;i<templates.length;++i) {
		item[templates[i].name] = this[templates[i].name];
	}
	return item;
};

Skill.prototype.getDesc = function(lv) {
	var content=''
	var details=[];
	for(var i=0;i<this.effects.length;++i) {
		var effectDesc = this.effects[i].getDesc(lv);
		content += '<p>'+effectDesc.content+'</p>';
		details = details.concat(effectDesc.details);
	}
	return {'content':content, 'details':details};
};

Skill.postItems([
	['回復強化．一',[['st',['強回',0,1,[1,0],[0,1]]]],''],
	['回復強化．二',[['st',['強回',0,2,[1,0],[0,1]]]],''],
	['回復強化．三',[['st',['強回',0,3,[1,0],[0,1]]]],''],
	['回復強化．四',[['st',['強回',0,4,[1,0],[0,1]]]],''],
	
	['防禦強化．一',[['st',['強防',0,1,[1,0],[0,1]]]],''],
	['防禦強化．二',[['st',['強防',0,2,[1,0],[0,1]]]],''],
	['防禦強化．三',[['st',['強防',0,3,[1,0],[0,1]]]],''],
	['防禦強化．四',[['st',['強防',0,4,[1,0],[0,1]]]],''],
	
	['攻擊強化．一',[['st',['強攻',0,1,[1,0],[0,1]]]],''],
	['攻擊強化．二',[['st',['強攻',0,2,[1,0],[0,1]]]],''],
	['攻擊強化．三',[['st',['強攻',0,3,[1,0],[0,1]]]],''],
	['攻擊強化．四',[['st',['強攻',0,4,[1,0],[0,1]]]],''],
	
	['回攻強化．一',[['st',['強回',0,1,[0.5,0],[0,1]]],['st',['強攻',0,1,[0.5,0],[0,1]]]],''],
	['回攻強化．二',[['st',['強回',0,2,[0.5,0],[0,1]]],['st',['強攻',0,2,[0.5,0],[0,1]]]],''],
	['回攻強化．三',[['st',['強回',0,3,[0.5,0],[0,1]]],['st',['強攻',0,3,[0.5,0],[0,1]]]],''],
	['回攻強化．四',[['st',['強回',0,4,[0.5,0],[0,1]]],['st',['強攻',0,4,[0.5,0],[0,1]]]],''],
	
	['防回強化．一',[['st',['強防',0,1,[0.5,0],[0,1]]],['st',['強回',0,1,[0.5,0],[0,1]]]],''],
	['防回強化．二',[['st',['強防',0,2,[0.5,0],[0,1]]],['st',['強回',0,2,[0.5,0],[0,1]]]],''],
	['防回強化．三',[['st',['強防',0,3,[0.5,0],[0,1]]],['st',['強回',0,3,[0.5,0],[0,1]]]],''],
	['防回強化．四',[['st',['強防',0,4,[0.5,0],[0,1]]],['st',['強回',0,4,[0.5,0],[0,1]]]],''],
	
	['攻防強化．一',[['st',['強攻',0,1,[0.5,0],[0,1]]],['st',['強防',0,1,[0.5,0],[0,1]]]],''],
	['攻防強化．二',[['st',['強攻',0,2,[0.5,0],[0,1]]],['st',['強防',0,2,[0.5,0],[0,1]]]],''],
	['攻防強化．三',[['st',['強攻',0,3,[0.5,0],[0,1]]],['st',['強防',0,3,[0.5,0],[0,1]]]],''],
	['攻防強化．四',[['st',['強攻',0,4,[0.5,0],[0,1]]],['st',['強防',0,4,[0.5,0],[0,1]]]],''],
	
	['累積回復．一',[['st',['回復',0,2,[1,0],[0,1]]]],''],
	['累積回復．二',[['st',['回復',0,4,[1,0],[0,1]]]],''],
	['累積回復．三',[['st',['回復',0,6,[1,0],[0,1]]]],''],
	['累積回復．四',[['st',['回復',0,8,[1,0],[0,1]]]],''],
	
	['單體攻擊．一',[['xa',['單攻','atk',[400,1],[1200,0]]]],''],
	['單體攻擊．二',[['xa',['單攻','atk',[400,2],[ 600,0]]]],''],
	['單體攻擊．三',[['xa',['單攻','atk',[400,3],[ 400,0]]]],''],
	['單體攻擊．四',[['xa',['單攻','atk',[400,4],[ 300,0]]]],''],
	
	['全體攻擊．一',[['xa',['全攻','atk',[400,1],[ 600,0]]]],''],
	['全體攻擊．二',[['xa',['全攻','atk',[400,2],[ 300,0]]]],''],
	['全體攻擊．三',[['xa',['全攻','atk',[400,3],[ 200,0]]]],''],
	['全體攻擊．四',[['xa',['全攻','atk',[400,4],[ 150,0]]]],''],
	
	['流水之加持',[['st',['吮命',0,4,[1,0],[0,1]]]],''],
	['疾風之加持',[['st',['連擊',0,1,[1,0],[0,1]]]],''],
	['爆炎之加持',[['st',['擴散',0,1,[1,0],[0,1]]]],''],
	
	['漩渦護盾',[['st',['輕減',0,5,[1,0],[0,1]]]],''],
	['樹木護盾',[['st',['障壁',0,3,[1,0],[0,1]]]],''],
	['火炎護盾',[['st',['反射',0,1,[1,0],[0,1]]]],''],
	
	['冰霜之刺',[['st',['遲緩',0x110,4,[1,0],[0,1]]]],''],
	['毒蔓之刺',[['st',['中毒',0x110,6,[1,0],[0,1]]]],''],
	['熾燄之刺',[['st',['破甲',0x110,3,[1,0],[0,1]]]],''],
	
	
	['碧冰之魔矢',[['tr',[1,0]],['xa',['單攻','atk',[400,1],[600,0]]]],''],
	['緋冰之魔矢',[['tr',[2,0]],['xa',['單攻','atk',[400,1],[600,0]]]],''],
	['緋木之魔矢',[['tr',[2,1]],['xa',['單攻','atk',[400,1],[600,0]]]],''],
	['蒼木之魔矢',[['tr',[0,1]],['xa',['單攻','atk',[400,1],[600,0]]]],''],
	['蒼炎之魔矢',[['tr',[0,2]],['xa',['單攻','atk',[400,1],[600,0]]]],''],
	['碧炎之魔矢',[['tr',[1,2]],['xa',['單攻','atk',[400,1],[600,0]]]],''],
	
	['碧冰之風暴',[['tr',[1,0]],['xa',['全攻','atk',[400,1],[300,0]]]],''],
	['緋冰之風暴',[['tr',[2,0]],['xa',['全攻','atk',[400,1],[300,0]]]],''],
	['緋木之風暴',[['tr',[2,1]],['xa',['全攻','atk',[400,1],[300,0]]]],''],
	['蒼木之風暴',[['tr',[0,1]],['xa',['全攻','atk',[400,1],[300,0]]]],''],
	['蒼炎之風暴',[['tr',[0,2]],['xa',['全攻','atk',[400,1],[300,0]]]],''],
	['碧炎之風暴',[['tr',[1,2]],['xa',['全攻','atk',[400,1],[300,0]]]],''],
	
	['碧冰之靈藥',[['tr',[1,0]],['xa',['單回','hel',[0,1],[1200,0]]]],''],
	['緋冰之靈藥',[['tr',[2,0]],['xa',['單回','hel',[0,1],[1200,0]]]],''],
	['緋木之靈藥',[['tr',[2,1]],['xa',['單回','hel',[0,1],[1200,0]]]],''],
	['蒼木之靈藥',[['tr',[0,1]],['xa',['單回','hel',[0,1],[1200,0]]]],''],
	['蒼炎之靈藥',[['tr',[0,2]],['xa',['單回','hel',[0,1],[1200,0]]]],''],
	['碧炎之靈藥',[['tr',[1,2]],['xa',['單回','hel',[0,1],[1200,0]]]],''],
]);
